function VisaTypes() {
  const visaTypes: { type: string; desc: string }[] = [
    {
      type: "ویزای توریستی",
      desc: "ویزای توریستی  از پرطرفدارترین انواع ویزا است که با هدف گردشگری صادر می‌شود. از میان انواع ویزای ، امکان اخذ ویزای توریستی در فلای‌تودی برای شما فراهم شده است. مدت زمان اقامت در  با این ویزا کمتر از 60 روز است و شامل دو نوع سینگل و مولتی می‌شود  که می‌توانید از طریق فلای‌تودی برای اخذ آنها اقدام کنید.",
    },
    {
      type: "ویزا سینگل ",
      desc: "این ویزا از نوع ویزای توریستی است که تنها برای یک بار ورود به شهر  اعتبار دارد. به این ترتیب، با خروج از امارات متحده عربی، حتی اگر اعتبار ویزا باقی مانده باشد، امکان ورود مجدد با این ویزا وجود ندارد. مدت زمان اقامت در  با ویزای سینگل، بر اساس تعداد روزهایی که در ویزا مشخص شده، تعیین می‌شود.",
    },
    {
      type: "ویزای مولتی ",
      desc: "این ویزا امکان ورود و خروج متعدد به  را تا پایان اعتبار فراهم می‌کند. به این ترتیب، مسافر می‌تواند تا پایان مهلت اعتبار ویزای خود چند بار از مرز خارج شده و دوباره وارد  شوند. ویزای مولتی  شامل ویزاهای 14 روزه، یک ماهه و دو ماهه است.",
    },
    {
      type: "ویزای تجاری ",
      desc: `
        ویزای تجاری 
تجار، مدیران شرکت‌ها و صاحبان مشاغل که با هدف تجارت یا راه‌اندازی کسب و کار به این شهر سفر می‌کنند، نیاز به اخذ ویزای تجاری  دارند. سرمایه‌گذاران، کارآفرینان، افراد ماهر، نخبه‌ها و دانشجویان برتر می‌توانند با اخذ ویزای سبز  و بدون نیاز به حمایت کارفرما (کفیل) در این شهر، به مدت 5 سال مجوز اقامت دریافت کنند. این افراد با داشتن ویزای طلایی  می‌توانند مدت زمان طولانی‌تری یعنی تا 10 سال همراه با پدر، مادر یا افراد تحت تکفل خود در این شهر زندگی کنند. 
        `,
    },
    {
      type: "ویزای کار ",
      desc: `ویزای کار 
برای افرادی که قصد کار در  را دارند و پیشنهاد شغلی از یک کارفرما دریافت کرده‌اند، ویزای کار  با اعتبار یک تا سه سال صادر می‌شود. ویزای کار به دارنده آن اجازه اقامت قانونی در  را می‌دهد و همچنین امکان بهره‌مندی از خدماتی مانند افتتاح حساب بانکی، اجاره مسکن و دریافت گواهینامه رانندگی را فراهم می‌کند.`,
    },
    {
      type: "ویزای تحصیلی ",
      desc: `
        ویزای تحصیلی 
ویزای تحصیلی  برای دانشجویانی صادر می‌شود که قصد ادامه تحصیل در دانشگاه‌ها یا موسسات آموزشی معتبر در  را دارند. این ویزا معمولا تا پایان دوره تحصیل معتبر است و به دانشجو اجازه اقامت قانونی در امارات متحده عربی را می‌دهد. برای دریافت این ویزا، متقاضی باید از یک موسسه آموزشی در  پذیرش تحصیلی دریافت کند.
        `,
    },
    {
      type: "ویزای ترانزیت ",
      desc: `
        چنانچه پرواز شما از امارات عبور می‌کند و در مسیر رسیدن به مقصد خود در شهر  توقف داشته باشید، باید ویزای ترانزیت  را تهیه کنید. در صورتی که بلیط هواپیما خود را از فلای‌تودی و با ایرلاین امارات تهیه کرده باشید، می‌توانید درخواست ویزای 48 ساعته یا 96 ساعته داشته باشید.
        `,
    },
  ];

  return (
    <div className="w-full rounded-[25px] border p-[25px] ">
      <div className="flex flex-col gap-y-[24px]">
        <p className="font-semibold text-[24px]">انواع ویزا</p>
        <p className="text-gray-600 text-[16px]">
          خوشبختانه شرایط دریافت ویزای امارات بسیار آسانتر از کشورهای عضو شینگن است. کسانی که قصد دارند ویزای دریافت کنند، نیازی به مراجعه
          به سفارت ندارند و می‌توانند به صورت اینترنتی ویزای خود را درخواست دهند. انواع ویزای بر اساس هدف سفر به این کشور و مدت زمان اقامت
          دسته‌بندی می‌شوند. به طور کلی، انواع ویزای عبارتند از:
        </p>
      </div>

      <div className="flex flex-col gap-y-7 mt-10">
        {visaTypes.map((visaType) => (
          <div className="flex  flex-col gap-y-[16px]">
            <p className="font-semibold text-gray-600 w-fit px-5 flex items-center justify-center bg-gray-100 rounded-full h-[45px]">
              {visaType.type}
            </p>
            <p className="text-gray-600 leading-8">{visaType.desc}</p>
          </div>
        ))}
      </div>
    </div>
  );
}

export default VisaTypes;
